{"NPCs":
[
	{
		"name": 	"Hank",
		"sprite": 	"havelockvetinari",
		"portrait":	"Drunkard",
		"x":		100,
		"y":		150,
		"speeches":
		[
			{
				"speech": "Good morning, Christopher. Welcome back. An exellent job you have done."
			},
			{
				"speech": "Your last cracking revealed that the country J is building a new AI-controlled war machine. ^The war machine can select its target by itself, which is obviously not complaint with the Three Laws of Robotics. ^This is a serious issue then. We will never leave the lives of the human in the hand of machines. ^So this time, your mission is to infiltrate into the computer system of country J. ^Unfortunately, our secret agent is seized and executed. We lost the access to the target's communication channel. ^Thereby, it's most likely that you also need to perform \"MITM\" attack to gurantee the messages pass through you."
			},
			{
				"speech": "` Are you ready for your intrusion?"
			}
		]
	},
	{
		"name": 	"Zack",
		"sprite": 	"cyangaramonde",
		"portrait": "pirate1",
		"x":		780,
		"y":		450,
		"speeches":
		[	
			{
				"speech": "Glad to be your coworker."
			},
			{
				"prerequisites":
				[
					{"npc": "Hank",
					"state": 1}
				],
				"speech": "Sniffing attack is the major form of attack that we will use. At success, you will get the credential of Country J's partner. ^Nevertheless, your rival could use hash to hamper your sniffing attack. ^In that case, you need to firstly use \"Dictionary attack\" to crack the hashing. ^You can also buy a \"Rainbow table\" to improve your \"Dictionary attack\"."
			},
			{
				"speech": "You can use Brtute-force attack to try out the password in an try-and-error manner, and it does not require MITM (Man-In-The-Middle). ^However, Brute-force attack is relatively inefficient, and the defensive AI may apply some techniques against this attempt."
			},
			{
				"speech": "One of the possible methods against our repetitive password trial is to enforce an limit for wrong passwords. However, we can reversely make use of it. ^By delibrately inserting wrong passwords, we can lock down the account of the innocent victim, which frustrates the clients as much as a DoS attack."
			}
		]
	},
	{
		"name": 	"Calvin",
		"sprite": 	"nickfury",
		"portrait": "pirate4",
		"x":		530,
		"y":		200,
		"speeches":
		[	
			{
				"speech": "Just as I said, HackIt is a terrific place for the talented, isn't it."
			},
			{
				"prerequisites":
				[
					{"npc": "Hank",
					"state": 1}
				],
				"speech": "I'm searching for a way to make the most of cracked login credential. I shall tell you when I get something of interest."
			}
		]
	},
	{
		"name": 	"Lucy",
		"sprite": 	"skye",
		"portrait": "thief3",
		"x":		180,
		"y":		480,
		"speeches":
		[	
			{
				"speech": "Your last intrusion was awesome!"
			},
			{
				"prerequisites":
				[
					{"npc": "Hank",
					"state": 1}
				],
				"speech": "When you find it hard to sniff the partner's credential, there is an alternative. ^Replay attack is one that requires no cracking. ^You just intercept the message, assuming its content is what you expected, and send the message again, as it was. ^It has not grant you as much valuable information as sniffing attack though, but it still deals damange to the target, and you earn."
			}
		]
	}
]
}