{"NPCs":
[
	{	"name": 	"Boss",
		"sprite": 	"steampunk_m1",
		"portrait":	"flintley",
		"x":		100,
		"y":		200,
		"speeches":
		[
			{
				"speech": "Hello, Godfried. Your performance during your internship years ago turns out quite up to our expectation. I hope you enjoyed your experience here."
			},
			{
				"speech": "There is a bad new here. My friend in ArtificialCore strongly suspects that the company is under security attack. ^Rumors says that the outbreak starts with the wireless network. ^This has reminds me that our company is also vulnerable to wireless attacks. ^We are still short of hands, so you get the chance to prove yourself again. ^Therefore, your mission is to protect our server, as well as the clients' important data. ^Thank to your previous work, our channel connecting our clients are encrypted. Whereas your senior still insists that we reinforce on wireless security... ^I don't know why. So, if you have some technical questions, go to ask him. Yeah, right there, topright corner near the exit. ^I'm sure that he will also be happy to meet you."
			},
			{
				"speech": "` Our time is limited. So, are you ready to act?"
			}
		]
	},
	{	"name": 	"Senior",
		"sprite": 	"officeman4",
		"portrait": "youngbusinessman",
		"x":		830,
		"y":		150,
		"speeches":
		[	
			{
				"speech": "Hi, Godfried! Good to see you again."
			},
			{
				"prerequisites":
				[
					{"npc": "Boss",
					"state": 1}
				],
				"speech": "You are asking why encryption alone will not protect us? ^Right. The attackers this time was clearly aware of the encryption. As a result, they attacked the remote users to the service. ^They perform some specific MITM attacks. And they launched XSS (Cross-Site scrypting) attack. The latter is not a cracking on passwords, but an abuse of the session cookie."
			},
			{
				"speech": "Sorry that I can not directly help you with the defence. Our boss have instructed me to deal with a data recovery... ^Nevertheless, he has faith in you, otherwise, he would not let you in charge of the defence of wireless networks."
			},
			{
				"speech": "Deauth attack is annoying. Unfortunately it's not much defendable. ^Nevetheless, compared to be kicked offline, your reconnection attempt is more what the hackers want."
			}
		]
	},
	{	"name": 	"Cyborg",
		"sprite": 	"chewie",
		"portrait": "cyborg1",
		"x":		530,
		"y":		300,
		"speeches":
		[	
			{
				"speech": "Hi, Godfried! Still recognize me? As you can see, I have made myself a cyborg! ^With the help of the machine, I have experienced a great boost in physical activity and memory as well!"
			},
			{
				"prerequisites":
				[
					{"npc": "Boss",
					"state": 1}
				],
				"speech": "Your main target is to protect the cookies... ^I don't mean the biscuits of course. I mean the client side cookies inside their browsers. ^For example, you can bind the cookies to the IP address, so that the intruder with different IP address cannot reuse the cookie of our clients. ^Alternatively, if you set the \"HTTP-only\" flag in the cookie, the intruder's javascript code cannot obtain the cookie from your browser."
			},
			{
				"speech": "Those attacks like ARP poisoning has been known long ago. It's based on the shortcoming of shared network devices. ^ARP firewall is always available for this issue."
			},
			{
				"speech": "Manual DNS setting is useful to protect your DNS service: the clients only consider the DNS replies from the machines with the designated IP addresses. However, if the hackers use IP spoofing..."
			}
		]
	}
]
}