{"NPCs":
[
	{
		"name": 	"Hank",
		"sprite": 	"havelockvetinari",
		"portrait":	"Drunkard",
		"x":		100,
		"y":		150,
		"speeches":
		[
			{
				"speech": "Hi, Christopher! You probably have heard of ArtificialCore as a company researching on a strong AIs. ^Traced from your last cracked messages, we finally discovered that ArtificialCore is the one who is secretly developing AI for those war machines. ^Yeah, I'm also shocked, just like you. ^Undoubtedly, we will fight ArtificialCore from now on. ^Intelligence reports that, a weak point has been found on ArtificialCore's telecommuters and those on travel. ^This map marks the bars and houses where ArtificialCore's telecommutors usually stay, and ArtificialCore's managers usually travel from this airport. ^By going to these places, you can creep near the victim. ^Use your knowledge, especially the techniques on wireless networks, you can get something of ArtificialCore from these telecommuters. ^Tell me when you are prepared to depart."
			},
			{
				"speech": "` These wireless devices you may need are packed. Are you ready to go?"
			}
		]
	},
	{
		"name": 	"Zack",
		"sprite": 	"cyangaramonde",
		"portrait": "pirate1",
		"x":		780,
		"y":		450,
		"speeches":
		[	
			{
				"speech": "In this particular mission, if you have successfully performed one of the MITM (Man-In-The-Middle) attack, you will be rewarded a little bonus. ^However, in order to deal enough damange to the designated service and achieve your victory, you should still concentrate on \"finishing move\" like XSS (Cross-Site Scripting)."
			},
			{
				"speech": "Still, we are developing a new form of attack as \"finishing move\". Probably you will be informed of it during your attack."
			}
		]
	},
	{
		"name": 	"Calvin",
		"sprite": 	"nickfury",
		"portrait": "pirate4",
		"x":		530,
		"y":		200,
		"speeches":
		[	
			{
				"speech": "ArtificialCore may give out some Tips on network security to its telecommutors. This will protect the telecommuters from falling for some of your tricks. ^The good news is that, people are forgetful. The employees forget about the tips after sometime, when you can relaunch your attack."
			},
			{
				"speech": "The attack path starting from \"Deauth attack\" is long. The defender may have set some blocks in the way. Alternatively, you can use \"DNS cache poisoning\", to poisoning computers caches in a large area. ^In either way, you end your chain of attacks with XSS."
			}
		]
	},
	{
		"name": 	"Lucy",
		"sprite": 	"skye",
		"portrait": "thief3",
		"x":		180,
		"y":		480,
		"speeches":
		[	
			{
				"speech": "You are going to go near the victim and connect to the same wireless network. ^In this situation, DEAUTH attack is quite useful. ^It can kick the victim offline, which means the victim cannot perform any other actions during that time. ^Meanwhile, when attempting to reconnection to the wireless network, the victim is quite likely to fall into our Rogue Access Point. ^Then, you can trap the victim deeper and deeper, until you launch a XSS attack to steal the victim's precious cookie. ^In short words, I suggest you perform a combo of \"Deauth attack + Rogue access point + Rogue DHCP server + Rogue DNS server + XSS\". ^As a matter of fact, the three attacks in the middle actually belong to \"MITM\" attack."
			}
		]
	}
]
}