{"name":					"Attack on Enigma",
"serverCapacity":			2,
"serverRequestValley":		1,
"serverRequestPeak":		1,
"initialResource":			[80, 40],
"constantIncome":			[20,0],
"maxResource":				250,
"maxRounds":				16,
"assets":					150,
"defensive":				false,
"characterName":
[
	"Alan Turing",
	"Enigma"
],
"portrait":
[
	"AlanTuring",
	"Enigma"
],
"commonActs": 
[
	[],
	[]
],
"acts": 
[
	[
		{
			"name":				"Sniffing attack",
			"learningCost":		0,
			"desc":				"Finishing move. \nTo capture Nazi's secret message. Should be performed when the encryption is broken.",
			"needRivalBuffs":	["Shared channel"],
			"noRivalBuffs":		["Encrypt with Enigma", "Confidential message divulged"],
			"cost":				5,
			"rivalBuffs":		["Confidential message divulged"],
			"buffLength":		2,
			"bonus":			50,
			"learnt":			true
		},
		{
			"name":				"Brute-force attack",
			"desc":				"Supporting category \nThe most basic form of attack on the cipher code. It tries all possible combinations until succeeds. It turn out nearly infeasible in face of strong encryption.",
			"needRivalBuffs":	["Encrypt with Enigma"],
			"cost":				20,
			"successRate":		0.05,
			"cleanRivalBuffs":	["Encrypt with Enigma"],
			"buffLength":		2
		},
		{
			"name":				"Known-plaintext attack",
			"prerequisites":	["Brute-force attack"],
			"learningCost":		10,
			"desc":				"Supporting category \nWith some or all of the plaintext already known, a big amount of possible situations is eliminated. Therefore, the cracking process is greatly boosted.",
			"needRivalBuffs":	["Encrypt with Enigma"],
			"cost":				20,
			"successRate":		0.19,
			"cleanRivalBuffs":	["Encrypt with Enigma"],
			"buffLength":		2,
			"unlocked":			false
		},
		{
			"name":				"Chosen-plaintext attack",
			"prerequisites":	["Known-plaintext attack"],
			"learningCost":		15,
			"desc":				"Supporting category \ndeliberately enforce some of the plaintexts in favor of the cracking of security key. More effective than Known-plaintext attack",
			"needRivalBuffs":	["Encrypt with Enigma"],
			"cost":				25,
			"successRate":		0.24,
			"cleanRivalBuffs":	["Encrypt with Enigma"],
			"buffLength":		2,
			"unlocked":			false
		},
		{
			"name":				"Bombe",
			"learningCost":		30,
			"noSelfBuffs":		["Bombe"],
			"desc":				"Improvement. \nBritish electro-mechanical device used to crack Enigma. Greatly improves your cracking power (enhances Brute-force attack, Known-plaintext attack and Chosen-plaintext attack).",
			"cost":				35,
			"selfBuffs":		["Bombe"],
			"buffLength":		-1,
			"modifier":			"0:Brute-force attack:successRate:*:2;0:Known-plaintext attack:successRate:*:2;0:Chosen-plaintext attack:successRate:*:2",
			"unlocked":			false
		},
		{
			"name":				"Gordon's improvement",
			"needSelfBuffs":	["Bombe"],
			"noSelfBuffs":		["Gordon's improvement"],
			"desc":				"Improvement. \nGordon's improvement makes Bombe even more efficient at cracking Enigma (enhances Brute-force attack, Known-plaintext attack and Chosen-plaintext attack).",
			"cost":				30,
			"selfBuffs":		["Gordon's improvement"],
			"buffLength":		-1,
			"modifier":			"0:Brute-force attack:successRate:*:2;0:Known-plaintext attack:successRate:*:2;0:Chosen-plaintext attack:successRate:*:2",
			"unlocked":			false
		}
	],
	[
		{
			"name":				"Encrypt with Enigma",
			"desc":				"German's state of the art encryption technology",
			"cost":				10,
			"selfBuffs":		["Encrypt with Enigma"],
			"buffLength":		2,
			"learnt":			true
		}
	]
],
"commonBuffs":
[
	"503 Server Unavailable", "Shared channel"
],
"buffs":
[
	{	"name":	"Encrypt with Enigma",
		"desc": "The German communication is encrypted with Enigma machine. It's really hard to break the ciphertext without know the key."
	},
	{	"name":	"Confidential message divulged",
		"desc": "The Enigma encryption is cracked, and German's confidential messages for the day are divulged to the Allies. Great work! \nYou can wait until the next day before launching another attack."
	},
	{	"name":	"Bombe",
		"desc": "With the help of the machine, cracking becomes much quicker."
	},
	{	"name":	"Gordon's improvement",
		"desc": "Thanks to Gordon's observation, the area where Bombe has to search for encryption key has greatly shrunken. The cracking probability greatly increased."
	}
],
"initialBuffs":
[
	[
		{
			"name":		"Shared channel",
			"length":	-1
		}
	],
	[
		{
			"name":		"Shared channel",
			"length":	-1
		}
	]
],
"AI":
[
	{
		"pattern":
		[
			"Encrypt with Enigma"
		],
		"chance":	1
	}
],
"scripts":
[
	{
		"round": 2,
		"dialogues":
		[
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Unbelievable! The polish cryptanalysts have already broken the unbreakable Enigma! ^It's only a pity that the German has improved the machine, making the polish technique hardly effective. ^What's worse, now the whole Poland has fallen to German. ^I have to break the improved Enigma, so as to save Allies from the scourge of the Nazi."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Our mission is to break the Enigma encryption, and then use \"Sniffing attack\" to get Nazi's secret messages in the same day. ^The main challenge here is how to break. Brute-force attack, the only currently available attack is too inefficient."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "I should not launch any attacks before we have descovered better techniques. \nIt will be a pity when we develop better cracking techniques, only to find insufficient resource to apply them."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Fellows, there is no mission for today, just get familar with your tools. \nOur dialogues are recorded in the memory.",
				"focusing": [205, 40, 103, 103]
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "By the way, for what an intruder should do in his/her round, see \"Play as intruder\" in personal notes.",
				"focusing": [110, 40, 92, 77]
			}
		]
	},
	{
		"round": 4,
		"dialogues":
		[
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "The work of cracking Enigma is beyond the computational power of human. ^Inspired by the Polish work , I strongly suggest us using machine to fight machine. ^Let's build a cracking machine called \"Bombe\", and use it against Enigma."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Um, the success rate of cracking is 10%. Still too inefficient."
			}
		],
		"newActs":
		[
			["Bombe"],
			[]
		],
		"shouldApply": ["Bombe"]
	},
	{
		"round": 6,
		"dialogues":
		[
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "The Nazi has become subtle. They change the Enigma setting at least once a day. ^You can see a buff \"Encrypt with Enigma\" on them, which indicates a new  Enigma setting.",
				"focusing": [850, 50, 124, 116]
			},	
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "This means that, if we have ever succeed in cracking its key (e.g. with \"Brute-force attack\"), we should immediately use the key to obtain the confidential information (with \"Sniffing attack\"). ^By doing these, Nazi's secret messages are compromised. Moreover, we will be awarded some more resources in honor of our success."
			}
		]
	},
	{
		"round": 8,
		"dialogues":
		[
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "It's discovered that, we can actually guess a part of the plaintext in the german messages. ^Sentences like \"nothing to report\", \"Hail Hitler\" could be conjectured in some places of the message. I call them \"crib\". ^With this knowledge, we can use the \"Known-plaintext attack\", instead of \"Brute-force attack\". It will greatly speed up our cracking process."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Ur, 38% success rate... We could try, but it's still not efficient. I personally prefer to wait until we reach 50% success rate."
			}
		],
		"newActs":
		[
			["Known-plaintext attack"],
			[]
		]
	},
	{
		"round": 10,
		"dialogues":
		[
			{
				"name":		"Gordon Welchman",
				"portrait":	"GordonWelchman",
				"dialogue":	"I have found some characteristics of Enigma. With these characteristics, I have an idea to substantially boost our cracking of Enigma. ^When you have applied my improvement, you will see the success rate of those cracking techniques like \"Brute-force attack\" or \"Known-plaintext attack\" increased."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Terrific. With this improvement, the cracking on Enigma finally becomes realistic."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "We should remember to firstly crack the encryption (e.g. with \"Known-plaintext attack\"). And, when successful, use \"Sniffing attack\" to obtain Nazi's top secrets. ^We can repeat this process each day, so as to always feed the Allies with newest information."
			}
		],
		"newActs":
		[
			["Gordon's improvement"],
			[]
		],
		"shouldApply": ["Gordon's improvement"]
	},
	{
		"round": 12,
		"dialogues":
		[
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "\"Known-plaintext attack\" is still a little slow in cracking Enigma. I'd like to use \"Chosen-plaintext attack\". ^We will instruct the Royal Air Force to lay mines at some positions which Germans have no abbreviation or alternative names. ^Germans may send warning messages when discovering the mines and \"all clear\" messages after removing the mines, all encrypted with Enigma. ^In this case, because we have substantial control over the plaintexts, we can properly choose those in favor of our cracking."
			},
			{
				"name": 	"Juan Pujol García",
				"portrait":	"JuanPujolGarcía",
				"dialogue": "I will join in with you! \nYou may have known me as Juan Pujol García, the double agent against Nazi. I will guarantee your crafted messages to be encrypted with Enigma."
			},
			{
				"name": 	"Alan Turing",
				"portrait":	"AlanTuring",
				"dialogue": "Excellent! Now we can use chosen-plaintext attack, which have a even higher cracking probability. ^Churchill will be amazed for our daily provision of Nazi's top secrets."
			}
		],
		"newActs":
		[
			["Chosen-plaintext attack"],
			[]
		]
	}
]
}