{"NPCs":
[
	{	"name": 	"Desk clerk",
		"sprite": 	"bridesmaid08",
		"portrait":	"redGirl",
		"x":		500,
		"y":		350,
		"speeches":
		[
			{
				"speech": "Good morning!\nYou are probably the security expert we just called for?\nYou can click on this dialogue to dismiss it.^ Our manager is thrilled hearing of your arrival. You can go to talk to him about your work. ^He is just in the top-left corner. \n(in lower voice)Yeah, the bald one."
			},	
			{
				"speech": "Have your met our boss? He is in the left top corner. For the detail of your work, ask him. I'm just a desk clerk..."
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 0}
				],
				"speech": "Me? I just receive guests as my manager tells."
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 2}
				],
				"speech": "See you. Glad having you by our side."
			}
		]
	},
	{	"name": 	"Manager",
		"sprite": 	"fredcolon",
		"portrait":	"jorek",
		"x":		100,
		"y":		150,
		"speeches":
		[
			{
				"speech": "Ah, finally. You have arrived. I'm nearly driven mad by the recent security breaches. ^The exposure of the company's credential files as well as the clients identity information has amount to billions of dollars. ^The leakage still continues, but I cannot find anything wrong. You see, we have installed the newest intrusion prevention system. Shouldn't be a problem. ^The CEOs warned that if I still cannot find the problem, they will kick me out.. ^Well, what already lost is lost. If you could find why the data leakage still goes on, it will be greatly appreciated. ^Just go around our company, chatting with different persons. Maybe you will find some clues. ^Report to me only when you have found the problem. I still have my work to do."
			},	
			{
				"speech": "So, have you talked to people around? Have you made some discoveries? Remember that people will never tell their secrets in the first chat."
			},
			{
				"prerequisites":
				[
					{"npc": "Bobby",
					"state": 3}
				],
				"speech": "Ah, so be it. It's the little bastard who opened the door for the intruder. ^Ok, ok. I shall heed your words. I will not just concentrate on punishing him, but more on raising my employees' awareness on system security. ^They shall understand the importance of the defensive system also. ^This breach has taught me a good lesson, that technology alone will not protect us. ^Oh, you just said human factor has become the severest part of computer security? Hard to believe! ^Thank you so much for your excellent work here, and this is the payment. ^I'm glad that you helped."
			},
			{
				"speech": "` So, are going to return home? I will call my driver."
			}
		]
	},
	{	"name": 	"Bobby",
		"sprite": 	"buckybarnes",
		"portrait": "hunter",
		"x":		780,
		"y":		450,
		"speeches":
		[	
			{	"speech": "Oh, a new face. Bobby's busy working."
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 0}
				],
				"speech": "This database is a mess!"
			},
			{
				"speech": "I work day and night just to catch up with our manager's plan, but this damn computer just react extremely slowly. ^I don't know why our manager just doesn't want to spend a little more on the computer."
			},
			{
				"speech": "Whenever you rebuilt your project, you have to close as much processes as possible. ^I will tell you a secret, newcomer.\nThis so called \"defensive system\" takes up huge amount of memory and CPU cycle. ^If you care to disable it... Your program will run completely smoothly. ^My last week's work was done thanks to it."
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 2}
				],
				"speech": "The manager said he will fire me for disabling the defensive system. Is it you who let out the information?"
			}
		]
	},
	{	"name": 	"Luisa",
		"sprite": 	"skye",
		"portrait": "rebina_casual",
		"x":		720,
		"y":		300,
		"speeches":
		[	
			{	"speech": "Oh, a new handsome boy here. Mind if I date you?"
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 0}
				],
				"speech": "I am just a saleswoman. I know nothing about what \"data loss\" means."
			},
			{
				"speech": "Maybe we can go out for the lunch? It will be even better if we go for dinner."
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 2}
				],
				"speech": "See you, handsome boy."
			}
		]
	},
	{	"name": 	"Herry",
		"sprite": 	"mamoruchiba",
		"portrait": "male1",
		"x":		65,
		"y":		450,
		"speeches":
		[	
			{	"speech": "Hey, newcomer, ur?"
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 0}
				],
				"speech": "I'm tired of working all day."
			},
			{
				"speech": "You know what? This video is excellent. ^What? Don't blame me. Who does not have a moment of break at working time?"
			},
			{
				"speech": "It's quite unfortunate that after the installation of the defensive system, we cannot anymore play MOBA game here...Well, during lunch time, during lunch time."
			},
			{
				"prerequisites":
				[
					{"npc": "Manager",
					"state": 2}
				],
				"speech": "Oh, you are going? I thought you are a new programmer here..."
			}
		]
	}
]
}