{"name":					"Network Defender",
"serverCapacity":			4,
"serverRequestValley":		5,
"serverRequestPeak":		6,
"initialResource":			[0, 0],
"constantIncome":			[40,0],
"maxResource":				200,
"maxRounds":				18,
"assets":					150,
"defensive":				true,
"characterName":
[
	"Unknown character",
	"Godfried"
],
"portrait":
[
	"unknownCharacter",
	"Godfried"
],
"commonActs": 
[
	[],
	["CDN"]
],
"acts": 
[
	[
		{
			"name":					"DDoS",
			"desc":					"DoS category .\nDistributed Denial of Service attack makes use of a big crowd of computers to synchronously attack the victim server. With large amount of botnet machines, its success rate is much more than the original DOS attack. Its effect is based on how many botnet machines bought.",
			"cost":					30,
			"rivalBuffs":			["Denial of service attacked"],
			"buffLength":			2,
			"superfluousRequests":	8,
			"unlocked":				false
		},
		{
			"name":				"MITM",
			"desc":				"Perform a Man-In-The-Middle attack. If no authentication or encryption of any kind, give the buff \"MITM\".",
			"cost":				15,
			"rivalBuffs":		["MITM"],
			"buffLength":		2,
			"unlocked":			false
		},
		{
			"name":				"Sniffing attack",
			"learningCost":		10,
			"desc":				"Finishing move. \nObtain rival's username and password, as well as other data, provided that the communication is not encrypted.",
			"needRivalBuffs":	["MITM"],
			"noRivalBuffs":		["Encrypted", "Credential compromised"],
			"cost":				10,
			"rivalBuffs":		["Credential compromised"],
			"buffLength":		2,
			"bonus":			50,
			"unlocked":			false
		}		
	],
	[
		{
			"name":			"CAPTCHA",
			"learningCost":	5,
			"desc":			"Completely Automated Public Turing test to tell Computers and Humans Apart. Grant 60% defense against DDoS attacks.",
			"cost":			20,
			"selfBuffs":	["CAPTCHA"],
			"buffLength":	10,
			"unlocked":		false
		},
		{
			"name":			"Symmetric cryptography",
			"learningCost":	5,
			"desc":			"The knowledge of symmetric cryptography. prerequisites for nearly all the encryption techniques.",
			"cost":			0,
			"unlocked":		false
		},
		{
			"name":			"DES",
			"prerequisites":	["Symmetric cryptography"],
			"learningCost":	5,
			"desc":			"One of the historical symmetric-key algorithm used for encryption. Obsolete now.",
			"cost":			0,
			"unlocked":		false
		},
		{
			"name":			"3DES",
			"prerequisites":	["DES"],
			"learningCost":	5,
			"desc":			"One symmetric encryption method to encrypt with DES three times to achieve the satisfying security strength.",
			"cost":			15,
			"selfBuffs":	["Encrypted"],
			"buffLength":	4,
			"unlocked":		false
		}
	]
],
"commonBuffs":
[
	 "503 Server Unavailable", "Denial of service attacked", "CDN", "Encrypted", "Credential compromised", "MITM"
],
"buffs":
[
	{
		"name":				"CAPTCHA",
		"desc":				"Completely Automated Public Turing test to tell Computers and Humans Apart. Widely used by websites to keep off automated attacks in cases likea registration or login.",
		"upkeep":			1,
		"dosResistance":	0.6
	}
],
"initialActs":
[
	[],
	[]
],
"initialBuffs":
[
	[],
	[]
],
"AI":
[
	{
		"pattern":
		["DDoS", "MITM", "Sniffing attack"],
		"chance":	1
	},
	{
		"pattern":
		["DDoS"],
		"chance":	1
	}
],
"scripts":
[
	{
		"round": 1,
		"dialogues":
		[
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "Ah, get a little nervous for my first internship in network defense. Let's see what are there. ^In the top-left corner, there are menu button, my personal notes and the action log. A round indicator nearby is also telling that this is round 1 out of the 18 rounds. ^I love the action log. With it, I can know the detail information about actions performed by me and by the potential intruder, did they failed, and why they failed. For the current moment it's empty though. ^I can't wait to have a look at the computer provided by the company. Oh, it's just down here. On the screen, the possible acts I can perform is displayed. Now there is only a \"CDN\". ^Nevertheless, no mission is assigned for the moment, so I will just look around and do no acts. ^Then, I will click on the \"End turn\" button near the top-left corner to end my turn."
			}
		]
	},
	{
		"round": 3,
		"dialogues":
		[
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Hei, Godfried, come here. One important work for you. ^You should have known that, this is a network company, whose business is to serve incoming client requests. ^From our investigation, we discovered that the current number of requests has surpassed the capacity our server. Not to say the rush hours. ^Probably you have already see one or two unhappy faces popping out. Each unhappy face represent the failure to serve one client request, while each happy face for one served client request. ^One served client will grant you 10 resource, but one unserved client will result in 5 resource lose. ^Whenever any of the clients encounter problems getting served, they will report to us that they get the \"503 Server Unavailable\" page. ^A buff in this name is presented on you, to warn you of the problem. You can find buffs on you by clicking on your portrait, or by the \"S\" shortcut key. Yeah, try it now. Have you seen \"503 Server Unavailable\"? ^In such a buff list, if you click on one particular buff, you can view the buff detail. ^Moreover, at the buff detail page, the book-like button will directly lead you to the corresponding term in your personal notes. The shortcut key for personal notes is \"N\"."
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "Um, so, similarly to my portrait, rival's portrait will lead to the list of buffs on him/her also?"
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Right. And the shortcut key for the rival is \"R\". \nWe have not encounter any intruder yet, and you see no buff there. ^Now, in order to deal with the problem of server capacity, I suggest you build something like CDN (Content Delivery Network) to increase our server capacity."
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "(Yeah, of course. There is only a \"CDN\" on my computer. What else do you expect me to do...) ^By the way, I firstly heard of \"CDN\" back in the university. How I miss the days when we were young... We played basketball on the court, we chased beautiful girls... ^Oh, sorry for getting sidetracked. Anyway, there is an entry of CDN in my personal notes. I will refer to it when I need more information. ^However, theory is one thing, and practice is another. I haven't really built one with my own hands yet. I have to firstly study what practically should be done."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "I will give you a jumpstart this time. Click on \"CDN\" on the screen, then click on \"learn\" (shortcut key \"E\"). After that, you can \"Apply\" it to our server (shortcut key \"A\"). ^When \"CDN\" is applied, you can end the turn."
			}
		],
		"shouldApply": ["CDN"]
	},
	{
		"round": 5,
		"dialogues":
		[
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "With the CDN built, our server capacity has increased, and our business booms. no clients complains, and I earns more. ^Now there is a buff called \"CDN\" on me. And because the server capacity is high enough, no \"503 Server Unavailable\" buff anymore. ^My action of applying CDN is also recorded in the action log. ^No mission is assigned today, I will take a nap... \nLet's go to the next round."
			}
		],
		"newActs":
		[
			["DDoS"],
			[]
		]
	},
	{
		"round": 7,
		"dialogues":
		[
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "Ah, my work is easy and boring. It's too... unchallenging. I even start to expect some intruders now."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Hei, Godfried, dont' Jinx it. ^Intelligence tells that a group of hackers have targeted us. They used to launch DoS... Well, actually DDoS attack to paralyze the target server. ^CDN itself provides some defense against those like DoS attack, and that's one of the reasons why I suggested you CDN last time. ^However, CDN alone is supposed to be inadequate for the defense. ^Wait, the newest report says that they have already started DDoS attack on us! ^See that in the action logs (shortcut key \"L\")? ^We should immediately apply CAPTCHA to intercept as much spam requests as possible. Otherwise, our server will be totally flooded with their spam requests."
			}
		],
		"newActs":
		[
			[],
			["CAPTCHA"]
		],
		"shouldApply": ["CAPTCHA"]
	},
	{
		"round": 9,
		"dialogues":
		[
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Godfried! How is it going?"
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "At ease, the CAPTCHA is already in use."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Nevertheless, clients still complain about the \"503 Server Unavailable\" error."
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "What? Why? The defense should be airtight."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Not like other types of attack, DoS attack is quite unlikely to be totally resolved. What we do is only to alleviate its harm. Don't you know that? Go back and check your personal notes!"
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "Well, as you say it... I remember hearing that in the university. ^Oh, I see. This point was not one of those questions for the examination, so I just..."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Ok. Enough. ^I have searched the repository of our company. It's a pity that we cannot put up more defense for now. The only thing we can do is just to wait for them to stop... ^But at least we have kept the majority of spam requests out. ^By the way, if you check the buff \"CAPTCHA\", you will see it has an upkeep, which means you will earn a little less. ^This is because some clients don't like CAPTCHA, for it requires them to do one more validation. ^They just don't know, without CAPTCHA, our server will be engaged with spam requests, and they could not even connect to the server. ^So, no mission for the moment. Just keep an eye on the attacks."
			}
		],
		"newActs":
		[
			["MITM","Sniffing attack"],
			[]
		]
	},
	{
		"round": 11,
		"dialogues":
		[
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "An urgent report! ^The hackers started to intercept messages between our server and our clients. ^Some clients have reported that their login passwords are uncovered. ^I will not tell them that our connections with them are actually unencrypted... ^You may have already noticed that some of our assets are already lost due to this leakage. A buff called \"Credential compromised\" is also created on you to indicate the data leakage. ^Godfried, quickly find a solution to encrypt our messages!"
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "eh, encryption... ^My memory of cryptography has faded with time. I have nearly forgotten everything just one month after the exam... ^I need to review the knowledge of \"symmetric cryptography\" first. It's the prerequisite for message encryption. ^Nevertheless, after symmetric cryptography, I need to select a specific encryption technique and \"apply\" it."
			}
		],
		"newActs":
		[
			[],
			["Symmetric cryptography", "DES","3DES"]
		],
		"shouldApply": ["3DES"]
	},
	{
		"round": 13,
		"dialogues":
		[
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "So you have encrypted our message with 3DES. I was worried that you would use DES."
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "I'm not that stupid. ^DES has been obsolete long ago. With the current computational power, DES with its short key could be cracked within a day. Therefore, I have not even considered DES a choice."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Nice work. ^Now there is another issue. Our contract with the ISP supporting our CDN service has expired. ^Our CDN is inactive again. Remember to renew the service."
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "Yes, I have also noticed the problem with CDN... The buff vanished, and more clients complains. ^Um, to solve the problem, I don't have to re-learn CDN, I will just re-apply it. ^N.B. The list of buffs on me may expand across pages. I may need to use scroll arrow to see all the buffs."
			}
		],
		"shouldApply":	["CDN"]
	},
	{
		"round": 15,
		"dialogues":
		[
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "The hackers are annoying! Why are we just passively defending? Why don't we strike back?"
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "Strike back? Not to say the fact that it's against the law that we perform network attacks. Just think of this, who are you going to attack?"
			},
			{
				"name": 	"Godfried",
				"portrait":	"Godfried",
				"dialogue": "The hackers of course! From their connection attempts we have obtained their IP address... ^Oh, I see, for the DDoS attack, the spam requests come from the manipulated machines, not the real hackers'. And for other attacks, intruders can also easily use IP spoofing to hide their real IP addresses."
			},
			{
				"name": 	"Senior",
				"portrait":	"youngbusinessman",
				"dialogue": "At least this time you have realized the point by yourself. ^A tip here: it's possible that you re-apply a defensive act before its related buff expires. The buff length will be refreshed. ^It's not so much cost-effective, but you may need such kind of operation in the future. ^By the way, except for CDN, you should also care about the expiration of other buffs. ^You don't want our server be exposed to attacks again, do you? ^It should be known that, as defender, you should frequently check the positive buffs on you. Except that you can remember the expiration day of all the buffs. ^Just keep going. It's almost done. I believe you can sustain the last days."
			}
		]
	}
]
}